{
    "id": "ac-3.14",
    "class": "SP800-53-enhancement",
    "title": "Individual Access",
    "parameters": [
        {
            "id": "ac-3.14_prm_1",
            "label": "organization-defined mechanisms"
        },
        {
            "id": "ac-3.14_prm_2",
            "label": "organization-defined elements"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "AC-3(14)"
        },
        {
            "name": "sort-id",
            "value": "AC-03(14)"
        }
    ],
    "links": [
        {
            "href": "#ia-8",
            "rel": "related",
            "text": "IA-8"
        },
        {
            "href": "#pm-22",
            "rel": "related",
            "text": "PM-22"
        },
        {
            "href": "#pm-20",
            "rel": "related",
            "text": "PM-20"
        },
        {
            "href": "#pm-21",
            "rel": "related",
            "text": "PM-21"
        }
    ],
    "parts": [
        {
            "id": "ac-3.14_smt",
            "name": "statement",
            "prose": "Provide {{ ac-3.14_prm_1 }} to enable individuals to have access to the following elements of their personally identifiable information: {{ ac-3.14_prm_2 }}."
        },
        {
            "id": "ac-3.14_gdn",
            "name": "guidance",
            "prose": "Individual access affords individuals the ability to review personally identifiable information about them held within organizational records, regardless of format. Access helps individuals to develop an understanding about how their personally identifiable information is being processed. It can also help individuals ensure that their data is accurate. Access mechanisms can include request forms and application interfaces. For federal agencies, [PRIVACT] processes can be located in systems of record notices and on agency websites. Access to certain types of records may not be appropriate (e.g., for federal agencies, law enforcement records within a system of records may be exempt from disclosure under the [PRIVACT]) or may require certain levels of authentication assurance. Organizational personnel consult with the senior agency official for privacy and legal counsel to determine appropriate mechanisms and access rights or limitations."
        }
    ],
    "group_title": "Access Control"
}