{
    "id": "ac-3.7",
    "class": "SP800-53-enhancement",
    "title": "Role-based Access Control",
    "parameters": [
        {
            "id": "ac-3.7_prm_1",
            "label": "organization-defined roles and users authorized to assume such roles"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "AC-3(7)"
        },
        {
            "name": "sort-id",
            "value": "AC-03(07)"
        }
    ],
    "parts": [
        {
            "id": "ac-3.7_smt",
            "name": "statement",
            "prose": "Enforce a role-based access control policy over defined subjects and objects and control access based upon {{ ac-3.7_prm_1 }}."
        },
        {
            "id": "ac-3.7_gdn",
            "name": "guidance",
            "prose": "Role-based access control (RBAC) is an access control policy that enforces access to objects and system functions based on the defined role (i.e., job function) of the subject. Organizations can create specific roles based on job functions and the authorizations (i.e., privileges) to perform needed operations on the systems associated with the organization-defined roles. When users are assigned to specific roles, they inherit the authorizations or privileges defined for those roles. RBAC simplifies privilege administration for organizations because privileges are not assigned directly to every user (which can be a large number of individuals) but are instead acquired through role assignments. RBAC can also increase privacy and security risk if individuals assigned to a role are given access to information beyond what they need to support organizational missions or business functions. RBAC can be implemented as a mandatory or discretionary form of access control. For organizations implementing RBAC with mandatory access controls, the requirements in AC-3(3) define the scope of the subjects and objects covered by the policy."
        }
    ],
    "group_title": "Access Control"
}