{
    "id": "ac-4.1",
    "class": "SP800-53-enhancement",
    "title": "Object Security and Privacy Attributes",
    "parameters": [
        {
            "id": "ac-4.1_prm_1",
            "label": "organization-defined security and privacy attributes"
        },
        {
            "id": "ac-4.1_prm_2",
            "label": "organization-defined information, source, and destination objects"
        },
        {
            "id": "ac-4.1_prm_3",
            "label": "organization-defined information flow control policies"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "AC-4(1)"
        },
        {
            "name": "sort-id",
            "value": "AC-04(01)"
        }
    ],
    "parts": [
        {
            "id": "ac-4.1_smt",
            "name": "statement",
            "prose": "Use {{ ac-4.1_prm_1 }} associated with {{ ac-4.1_prm_2 }} to enforce {{ ac-4.1_prm_3 }} as a basis for flow control decisions."
        },
        {
            "id": "ac-4.1_gdn",
            "name": "guidance",
            "prose": "Information flow enforcement mechanisms compare security and privacy attributes associated with information (i.e., data content and structure) and source and destination objects and respond appropriately when the enforcement mechanisms encounter information flows not explicitly allowed by information flow policies. For example, an information object labeled Secret would be allowed to flow to a destination object labeled Secret, but an information object labeled Top Secret would not be allowed to flow to a destination object labeled Secret. A dataset of personally identifiable information may be tagged with restrictions against combining with other types of datasets and, thus, would not be allowed to flow to the restricted dataset. Security and privacy attributes can also include source and destination addresses employed in traffic filter firewalls. Flow enforcement using explicit security or privacy attributes can be used, for example, to control the release of certain types of information."
        }
    ],
    "group_title": "Access Control"
}