{
    "id": "au-6.5",
    "class": "SP800-53-enhancement",
    "title": "Integrated Analysis of Audit Records",
    "parameters": [
        {
            "id": "au-6.5_prm_1",
            "select": {
                "how-many": "one or more",
                "alternatives": [
                    "vulnerability scanning information",
                    "performance data",
                    "system monitoring information",
                    "\n                     {{ au-6.5_prm_2 }}\n                  "
                ]
            }
        },
        {
            "id": "au-6.5_prm_2",
            "depends-on": "au-6.5_prm_1",
            "label": "organization-defined data/information collected from other sources"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "AU-6(5)"
        },
        {
            "name": "sort-id",
            "value": "AU-06(05)"
        }
    ],
    "links": [
        {
            "href": "#au-12",
            "rel": "related",
            "text": "AU-12"
        },
        {
            "href": "#ir-4",
            "rel": "related",
            "text": "IR-4"
        }
    ],
    "parts": [
        {
            "id": "au-6.5_smt",
            "name": "statement",
            "prose": "Integrate analysis of audit records with analysis of {{ au-6.5_prm_1 }} to further enhance the ability to identify inappropriate or unusual activity."
        },
        {
            "id": "au-6.5_gdn",
            "name": "guidance",
            "prose": "Integrated analysis of audit records does not require vulnerability scanning, the generation of performance data, or system monitoring. Rather, integrated analysis requires that the analysis of information generated by scanning, monitoring, or other data collection activities is integrated with the analysis of audit record information. Security Information and Event Management tools can facilitate audit record aggregation or consolidation from multiple system components as well as audit record correlation and analysis. The use of standardized audit record analysis scripts developed by organizations (with localized script adjustments, as necessary) provides more cost-effective approaches for analyzing audit record information collected. The correlation of audit record information with vulnerability scanning information is important in determining the veracity of vulnerability scans of the system and in correlating attack detection events with scanning results. Correlation with performance data can uncover denial-of-service attacks or other types of attacks that result in the unauthorized use of resources. Correlation with system monitoring information can assist in uncovering attacks and in better relating audit information to operational situations."
        }
    ],
    "group_title": "Audit and Accountability"
}