{
    "id": "cm-2.7",
    "class": "SP800-53-enhancement",
    "title": "Configure Systems and Components for High-risk Areas",
    "parameters": [
        {
            "id": "cm-2.7_prm_1",
            "label": "organization-defined systems or system components"
        },
        {
            "id": "cm-2.7_prm_2",
            "label": "organization-defined configurations"
        },
        {
            "id": "cm-2.7_prm_3",
            "label": "organization-defined controls"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "CM-2(7)"
        },
        {
            "name": "sort-id",
            "value": "CM-02(07)"
        }
    ],
    "links": [
        {
            "href": "#mp-4",
            "rel": "related",
            "text": "MP-4"
        },
        {
            "href": "#mp-5",
            "rel": "related",
            "text": "MP-5"
        }
    ],
    "parts": [
        {
            "id": "cm-2.7_smt",
            "name": "statement",
            "parts": [
                {
                    "id": "cm-2.7_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Issue {{ cm-2.7_prm_1 }} with {{ cm-2.7_prm_2 }} to individuals traveling to locations that the organization deems to be of significant risk; and"
                },
                {
                    "id": "cm-2.7_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Apply the following controls to the systems or components when the individuals return from travel: {{ cm-2.7_prm_3 }}."
                }
            ]
        },
        {
            "id": "cm-2.7_gdn",
            "name": "guidance",
            "prose": "When it is known that systems or system components will be in high-risk areas external to the organization, additional controls may be implemented to counter the increased threat in such areas. For example, organizations can take actions for notebook computers used by individuals departing on and returning from travel. Actions include determining the locations that are of concern, defining the required configurations for the components, ensuring that components are configured as intended before travel is initiated, and applying controls to the components after travel is completed. Specially configured notebook computers include computers with sanitized hard drives, limited applications, and more stringent configuration settings. Controls applied to mobile devices upon return from travel include examining the mobile device for signs of physical tampering and purging and reimaging disk drives. Protecting information that resides on mobile devices is addressed in the MP (Media Protection) family."
        }
    ],
    "group_title": "Configuration Management"
}