{
    "id": "cp-2.8",
    "class": "SP800-53-enhancement",
    "title": "Identify Critical Assets",
    "parameters": [
        {
            "id": "cp-2.8_prm_1",
            "select": {
                "alternatives": [
                    "all",
                    "essential"
                ]
            }
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "CP-2(8)"
        },
        {
            "name": "sort-id",
            "value": "CP-02(08)"
        }
    ],
    "links": [
        {
            "href": "#cm-8",
            "rel": "related",
            "text": "CM-8"
        },
        {
            "href": "#ra-9",
            "rel": "related",
            "text": "RA-9"
        }
    ],
    "parts": [
        {
            "id": "cp-2.8_smt",
            "name": "statement",
            "prose": "Identify critical system assets supporting {{ cp-2.8_prm_1 }} mission and business functions."
        },
        {
            "id": "cp-2.8_gdn",
            "name": "guidance",
            "prose": "Organizations may choose to identify critical assets as part of criticality analysis, business continuity planning, or business impact analyses. Organizations identify critical system assets so that additional controls can be employed (beyond the controls routinely implemented) to help ensure that organizational mission and business functions can continue to be conducted during contingency operations. The identification of critical information assets also facilitates the prioritization of organizational resources. Critical system assets include technical and operational aspects. Technical aspects include system components, information technology services, information technology products, and mechanisms. Operational aspects include procedures (i.e., manually executed operations) and personnel (i.e., individuals operating technical controls and/or executing manual procedures). Organizational program protection plans can assist in identifying critical assets. If critical assets are resident within or supported by external service providers, organizations consider implementing CP-2(7) as a control enhancement."
        }
    ],
    "group_title": "Contingency Planning"
}