{
    "id": "ia-5.10",
    "class": "SP800-53-enhancement",
    "title": "Dynamic Credential Binding",
    "parameters": [
        {
            "id": "ia-5.10_prm_1",
            "label": "organization-defined binding rules"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "IA-5(10)"
        },
        {
            "name": "sort-id",
            "value": "IA-05(10)"
        }
    ],
    "links": [
        {
            "href": "#au-16",
            "rel": "related",
            "text": "AU-16"
        },
        {
            "href": "#ia-5",
            "rel": "related",
            "text": "IA-5"
        }
    ],
    "parts": [
        {
            "id": "ia-5.10_smt",
            "name": "statement",
            "prose": "Bind identities and authenticators dynamically using the following rules: {{ ia-5.10_prm_1 }}."
        },
        {
            "id": "ia-5.10_gdn",
            "name": "guidance",
            "prose": "Authentication requires some form of binding between an identity and the authenticator that is used to confirm the identity. In conventional approaches, binding is established by pre-provisioning both the identity and the authenticator to the system. For example, the binding between a username (i.e., identity) and a password (i.e., authenticator) is accomplished by provisioning the identity and authenticator as a pair in the system. New authentication techniques allow the binding between the identity and the authenticator to be implemented external to a system. For example, with smartcard credentials, the identity and authenticator are bound together on the smartcard. Using these credentials, systems can authenticate identities that have not been pre-provisioned, dynamically provisioning the identity after authentication. In these situations, organizations can anticipate the dynamic provisioning of identities. Pre-established trust relationships and mechanisms with appropriate authorities to validate identities and related credentials are essential."
        }
    ],
    "group_title": "Identification and Authentication"
}