{
    "id": "ia-5.1",
    "class": "SP800-53-enhancement",
    "title": "Password-based Authentication",
    "parameters": [
        {
            "id": "ia-5.1_prm_1",
            "label": "organization-defined frequency"
        },
        {
            "id": "ia-5.1_prm_2",
            "label": "organization-defined composition and complexity rules"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "IA-5(1)"
        },
        {
            "name": "sort-id",
            "value": "IA-05(01)"
        }
    ],
    "links": [
        {
            "href": "#ia-6",
            "rel": "related",
            "text": "IA-6"
        }
    ],
    "parts": [
        {
            "id": "ia-5.1_smt",
            "name": "statement",
            "prose": "For password-based authentication:",
            "parts": [
                {
                    "id": "ia-5.1_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Maintain a list of commonly-used, expected, or compromised passwords and update the list {{ ia-5.1_prm_1 }} and when organizational passwords are suspected to have been compromised directly or indirectly;"
                },
                {
                    "id": "ia-5.1_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Verify, when users create or update passwords, that the passwords are not found on the list of commonly-used, expected, or compromised passwords in IA-5(1)(a);"
                },
                {
                    "id": "ia-5.1_smt.c",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(c)"
                        }
                    ],
                    "prose": "Transmit passwords only over cryptographically-protected channels;"
                },
                {
                    "id": "ia-5.1_smt.d",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(d)"
                        }
                    ],
                    "prose": "Store passwords using an approved salted key derivation function, preferably using a keyed hash;"
                },
                {
                    "id": "ia-5.1_smt.e",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(e)"
                        }
                    ],
                    "prose": "Require immediate selection of a new password upon account recovery;"
                },
                {
                    "id": "ia-5.1_smt.f",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(f)"
                        }
                    ],
                    "prose": "Allow user selection of long passwords and passphrases, including spaces and all printable characters;"
                },
                {
                    "id": "ia-5.1_smt.g",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(g)"
                        }
                    ],
                    "prose": "Employ automated tools to assist the user in selecting strong password authenticators; and"
                },
                {
                    "id": "ia-5.1_smt.h",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(h)"
                        }
                    ],
                    "prose": "Enforce the following composition and complexity rules: {{ ia-5.1_prm_2 }}."
                }
            ]
        },
        {
            "id": "ia-5.1_gdn",
            "name": "guidance",
            "prose": "Password-based authentication applies to passwords regardless of whether they are used in single-factor or multi-factor authentication. Long passwords or passphrases are preferable over shorter passwords. Enforced composition rules provide marginal security benefits while decreasing usability. However, organizations may choose to establish certain rules for password generation (e.g., minimum character length for long passwords) under certain circumstances and can enforce this requirement in IA-5(1)(h). Account recovery can occur, for example, in situations when a password is forgotten. Cryptographically protected passwords include salted one-way cryptographic hashes of passwords. The list of commonly used, compromised, or expected passwords includes passwords obtained from previous breach corpuses, dictionary words, and repetitive or sequential characters. The list includes context-specific words, such as the name of the service, username, and derivatives thereof."
        }
    ],
    "group_title": "Identification and Authentication"
}