{
    "id": "pl-4.1",
    "class": "SP800-53-enhancement",
    "title": "Social Media and External Site/application Usage Restrictions",
    "properties": [
        {
            "name": "label",
            "value": "PL-4(1)"
        },
        {
            "name": "sort-id",
            "value": "PL-04(01)"
        }
    ],
    "links": [
        {
            "href": "#ac-22",
            "rel": "related",
            "text": "AC-22"
        },
        {
            "href": "#au-13",
            "rel": "related",
            "text": "AU-13"
        }
    ],
    "parts": [
        {
            "id": "pl-4.1_smt",
            "name": "statement",
            "prose": "Include in the rules of behavior, restrictions on:",
            "parts": [
                {
                    "id": "pl-4.1_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Use of social media, social networking sites, and external sites/applications;"
                },
                {
                    "id": "pl-4.1_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Posting organizational information on public websites; and"
                },
                {
                    "id": "pl-4.1_smt.c",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(c)"
                        }
                    ],
                    "prose": "Use of organization-provided identifiers (e.g., email addresses) and authentication secrets (e.g., passwords) for creating accounts on external sites/applications."
                }
            ]
        },
        {
            "id": "pl-4.1_gdn",
            "name": "guidance",
            "prose": "Social media, social networking, and external site/application usage restrictions address rules of behavior related to the use of social media, social networking, and external sites when organizational personnel are using such sites for official duties or in the conduct of official business, when organizational information is involved in social media and social networking transactions, and when personnel access social media and networking sites from organizational systems. Organizations also address specific rules that prevent unauthorized entities from obtaining non-public organizational information from social media and networking sites either directly or through inference. Non-public information includes personally identifiable information and system account information."
        }
    ],
    "group_title": "Planning"
}