{
    "id": "pl-8.1",
    "class": "SP800-53-enhancement",
    "title": "Defense in Depth",
    "parameters": [
        {
            "id": "pl-8.1_prm_1",
            "label": "organization-defined controls"
        },
        {
            "id": "pl-8.1_prm_2",
            "label": "organization-defined locations and architectural layers"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "PL-8(1)"
        },
        {
            "name": "sort-id",
            "value": "PL-08(01)"
        }
    ],
    "links": [
        {
            "href": "#sc-2",
            "rel": "related",
            "text": "SC-2"
        },
        {
            "href": "#sc-3",
            "rel": "related",
            "text": "SC-3"
        },
        {
            "href": "#sc-29",
            "rel": "related",
            "text": "SC-29"
        },
        {
            "href": "#sc-36",
            "rel": "related",
            "text": "SC-36"
        }
    ],
    "parts": [
        {
            "id": "pl-8.1_smt",
            "name": "statement",
            "prose": "Design the security and privacy architectures for the system using a defense-in-depth approach that:",
            "parts": [
                {
                    "id": "pl-8.1_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Allocates {{ pl-8.1_prm_1 }} to {{ pl-8.1_prm_2 }}; and"
                },
                {
                    "id": "pl-8.1_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Ensures that the allocated controls operate in a coordinated and mutually reinforcing manner."
                }
            ]
        },
        {
            "id": "pl-8.1_gdn",
            "name": "guidance",
            "prose": "Organizations strategically allocate security and privacy controls in the security and privacy architectures so that adversaries must overcome multiple controls to achieve their objective. Requiring adversaries to defeat multiple controls makes it more difficult to attack information resources by increasing the work factor of the adversary; it also increases the likelihood of detection. The coordination of allocated controls is essential to ensure that an attack that involves one control does not create adverse, unintended consequences by interfering with other controls. Unintended consequences can include system lockout and cascading alarms. The placement of controls in systems and organizations is an important activity that requires thoughtful analysis. The value of organizational assets is an important consideration in providing additional layering. Defense-in-depth architectural approaches include modularity and layering (see SA-8(3)), separation of system and user functionality (see SC-2), and security function isolation (see SC-3)."
        }
    ],
    "group_title": "Planning"
}