{
    "id": "pl-9",
    "class": "SP800-53",
    "title": "Central Management",
    "parameters": [
        {
            "id": "pl-9_prm_1",
            "label": "organization-defined controls and related processes"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "PL-9"
        },
        {
            "name": "sort-id",
            "value": "PL-09"
        }
    ],
    "links": [
        {
            "href": "#27847491-5ce1-4f6a-a1e4-9e483782f0ef",
            "rel": "reference",
            "text": "[OMB A-130]"
        },
        {
            "href": "#482e4c99-9dc4-41ad-bba8-0f3f0032c1f8",
            "rel": "reference",
            "text": "[SP 800-37]"
        },
        {
            "href": "#pl-8",
            "rel": "related",
            "text": "PL-8"
        },
        {
            "href": "#pm-9",
            "rel": "related",
            "text": "PM-9"
        }
    ],
    "parts": [
        {
            "id": "pl-9_smt",
            "name": "statement",
            "prose": "Centrally manage {{ pl-9_prm_1 }}."
        },
        {
            "id": "pl-9_gdn",
            "name": "guidance",
            "prose": "Central management refers to organization-wide management and implementation of selected controls and processes. This includes planning, implementing, assessing, authorizing, and monitoring the organization-defined, centrally managed controls and processes. As the central management of controls is generally associated with the concept of common (inherited) controls, such management promotes and facilitates standardization of control implementations and management and the judicious use of organizational resources. Centrally managed controls and processes may also meet independence requirements for assessments in support of initial and ongoing authorizations to operate and as part of organizational continuous monitoring.\nAutomated tools (e.g., security information and event management tools or enterprise security monitoring and management tools) can improve the accuracy, consistency, and availability of information associated with centrally managed controls and processes. Automation can also provide data aggregation and data correlation capabilities; alerting mechanisms; and dashboards to support risk-based decision-making within the organization.\nAs part of the control selection processes, organizations determine the controls that may be suitable for central management based on resources and capabilities. It is not always possible to centrally manage every aspect of a control. In such cases, the control can be treated as a hybrid control with the control managed and implemented centrally or at the system level. The controls and control enhancements that are candidates for full or partial central management include but are not limited to: AC-2(1), AC-2(2), AC-2(3), AC-2(4), AC-4(all), AC-17(1), AC-17(2), AC-17(3), AC-17(9), AC-18(1), AC-18(3), AC-18(4), AC-18(5), AC-19(4), AC-22, AC-23, AT-2(1), AT-2(2), AT-3(1), AT-3(2), AT-3(3), AT-4, AU-3, AU-6(1), AU-6(3), AU-6(5), AU-6(6), AU-6(9), AU-7(1), AU-7(2), AU-11, AU-13, AU-16, CA-2(1), CA-2(2), CA-2(3), CA-3(1), CA-3(2), CA-3(3), CA-7(1), CA-9, CM-2(2), CM-3(1), CM-3(4), CM-4, CM-6, CM-6(1), CM-7(2), CM-7(4), CM-7(5), CM-8(all), CM-9(1), CM-10, CM-11, CP-7(all), CP-8(all), SC-43, SI-2, SI-3, SI-4(all), SI-7, SI-8."
        }
    ],
    "group_title": "Planning"
}