{
    "id": "pm-10",
    "class": "SP800-53",
    "title": "Authorization Process",
    "properties": [
        {
            "name": "label",
            "value": "PM-10"
        },
        {
            "name": "sort-id",
            "value": "PM-10"
        }
    ],
    "links": [
        {
            "href": "#482e4c99-9dc4-41ad-bba8-0f3f0032c1f8",
            "rel": "reference",
            "text": "[SP 800-37]"
        },
        {
            "href": "#cec037f3-8aba-4c97-84b4-4082f9e515d2",
            "rel": "reference",
            "text": "[SP 800-39]"
        },
        {
            "href": "#ca-6",
            "rel": "related",
            "text": "CA-6"
        },
        {
            "href": "#ca-7",
            "rel": "related",
            "text": "CA-7"
        },
        {
            "href": "#pl-2",
            "rel": "related",
            "text": "PL-2"
        }
    ],
    "parts": [
        {
            "id": "pm-10_smt",
            "name": "statement",
            "parts": [
                {
                    "id": "pm-10_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "a."
                        }
                    ],
                    "prose": "Manage the security and privacy state of organizational systems and the environments in which those systems operate through authorization processes;"
                },
                {
                    "id": "pm-10_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "b."
                        }
                    ],
                    "prose": "Designate individuals to fulfill specific roles and responsibilities within the organizational risk management process; and"
                },
                {
                    "id": "pm-10_smt.c",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "c."
                        }
                    ],
                    "prose": "Integrate the authorization processes into an organization-wide risk management program."
                }
            ]
        },
        {
            "id": "pm-10_gdn",
            "name": "guidance",
            "prose": "Authorization processes for organizational systems and environments of operation require the implementation of an organization-wide risk management process and associated security and privacy standards and guidelines. Specific roles for risk management processes include a risk executive (function) and designated authorizing officials for each organizational system and common control provider. The authorization processes for the organization are integrated with continuous monitoring processes to facilitate ongoing understanding and acceptance of security and privacy risks to organizational operations, organizational assets, individuals, other organizations, and the Nation."
        }
    ],
    "group_title": "Program Management"
}