{
    "id": "ra-2.1",
    "class": "SP800-53-enhancement",
    "title": "Impact-level Prioritization",
    "properties": [
        {
            "name": "label",
            "value": "RA-2(1)"
        },
        {
            "name": "sort-id",
            "value": "RA-02(01)"
        }
    ],
    "parts": [
        {
            "id": "ra-2.1_smt",
            "name": "statement",
            "prose": "Conduct an impact-level prioritization of organizational systems to obtain additional granularity on system impact levels."
        },
        {
            "id": "ra-2.1_gdn",
            "name": "guidance",
            "prose": "Organizations apply the “high-water mark” concept to each system categorized in accordance with [FIPS 199], resulting in systems designated as low impact, moderate impact, or high impact. Organizations that desire additional granularity in the system impact designations for risk-based decision-making, can further partition the systems into sub-categories of the initial system categorization. For example, an impact-level prioritization on a moderate-impact system can produce three new sub-categories: low-moderate systems, moderate-moderate systems, and high-moderate systems. Impact-level prioritization and the resulting sub-categories of the system give organizations an opportunity to focus their investments related to security control selection and the tailoring of control baselines in responding to identified risks. Impact-level prioritization can also be used to determine those systems that may be of heightened interest or value to adversaries or represent a critical loss to the federal enterprise, sometimes described as high value assets. For such high value assets, organizations may be more focused on complexity, aggregation, and information exchanges. Systems with high value assets can be prioritized by partitioning high-impact systems into low-high systems, moderate-high systems, and high-high systems. Alternatively, organizations can apply the guidance in [CNSSI 1253] for security objective-related categorization."
        }
    ],
    "group_title": "Risk Assessment"
}