{
    "id": "sa-15.1",
    "class": "SP800-53-enhancement",
    "title": "Quality Metrics",
    "parameters": [
        {
            "id": "sa-15.1_prm_1",
            "select": {
                "how-many": "one or more",
                "alternatives": [
                    "\n                     {{ sa-15.1_prm_2 }}\n                  ",
                    "\n                     {{ sa-15.1_prm_3 }}\n                  ",
                    "upon delivery"
                ]
            }
        },
        {
            "id": "sa-15.1_prm_2",
            "depends-on": "sa-15.1_prm_1",
            "label": "organization-defined frequency"
        },
        {
            "id": "sa-15.1_prm_3",
            "depends-on": "sa-15.1_prm_1",
            "label": "organization-defined program review milestones"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-15(1)"
        },
        {
            "name": "sort-id",
            "value": "SA-15(01)"
        }
    ],
    "parts": [
        {
            "id": "sa-15.1_smt",
            "name": "statement",
            "prose": "Require the developer of the system, system component, or system service to:",
            "parts": [
                {
                    "id": "sa-15.1_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Define quality metrics at the beginning of the development process; and"
                },
                {
                    "id": "sa-15.1_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Provide evidence of meeting the quality metrics {{ sa-15.1_prm_1 }}."
                }
            ]
        },
        {
            "id": "sa-15.1_gdn",
            "name": "guidance",
            "prose": "Organizations use quality metrics to establish acceptable levels of system quality. Metrics can include quality gates, which are collections of completion criteria or sufficiency standards that represent the satisfactory execution of specific phases of the system development project. For example, a quality gate may require the elimination of all compiler warnings or a determination that such warnings have no impact on the effectiveness of required security or privacy capabilities. During the execution phases of development projects, quality gates provide clear, unambiguous indications of progress. Other metrics apply to the entire development project. Metrics can include defining the severity thresholds of vulnerabilities in accordance with organizational risk tolerance, such as requiring no known vulnerabilities in the delivered system with a Common Vulnerability Scoring System (CVSS) severity of medium or high."
        }
    ],
    "group_title": "System and Services Acquisition"
}