{
    "id": "sa-17.4",
    "class": "SP800-53-enhancement",
    "title": "Informal Correspondence",
    "parameters": [
        {
            "id": "sa-17.4_prm_1",
            "select": {
                "alternatives": [
                    "informal demonstration",
                    "convincing argument with formal methods as feasible"
                ]
            }
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-17(4)"
        },
        {
            "name": "sort-id",
            "value": "SA-17(04)"
        }
    ],
    "links": [
        {
            "href": "#ac-3",
            "rel": "related",
            "text": "AC-3"
        },
        {
            "href": "#ac-4",
            "rel": "related",
            "text": "AC-4"
        },
        {
            "href": "#ac-25",
            "rel": "related",
            "text": "AC-25"
        },
        {
            "href": "#sa-4",
            "rel": "related",
            "text": "SA-4"
        },
        {
            "href": "#sa-5",
            "rel": "related",
            "text": "SA-5"
        }
    ],
    "parts": [
        {
            "id": "sa-17.4_smt",
            "name": "statement",
            "prose": "Require the developer of the system, system component, or system service to:",
            "parts": [
                {
                    "id": "sa-17.4_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Produce, as an integral part of the development process, an informal descriptive top-level specification that specifies the interfaces to security-relevant hardware, software, and firmware in terms of exceptions, error messages, and effects;"
                },
                {
                    "id": "sa-17.4_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Show via {{ sa-17.4_prm_1 }} that the descriptive top-level specification is consistent with the formal policy model;"
                },
                {
                    "id": "sa-17.4_smt.c",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(c)"
                        }
                    ],
                    "prose": "Show via informal demonstration, that the descriptive top-level specification completely covers the interfaces to security-relevant hardware, software, and firmware;"
                },
                {
                    "id": "sa-17.4_smt.d",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(d)"
                        }
                    ],
                    "prose": "Show that the descriptive top-level specification is an accurate description of the interfaces to security-relevant hardware, software, and firmware; and"
                },
                {
                    "id": "sa-17.4_smt.e",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(e)"
                        }
                    ],
                    "prose": "Describe the security-relevant hardware, software, and firmware mechanisms not addressed in the descriptive top-level specification but strictly internal to the security-relevant hardware, software, and firmware."
                }
            ]
        },
        {
            "id": "sa-17.4_gdn",
            "name": "guidance",
            "prose": "Correspondence is an important part of the assurance gained through modeling. It demonstrates that the implementation is an accurate transformation of the model, and that additional code or implementation detail has no impact on the behaviors or policies being modeled. Consistency between the descriptive top-level specification (i.e., high-level/low-level design) and the formal policy model is generally not amenable to being fully proven. Therefore, a combination of formal and informal methods may be needed to show such consistency. Hardware, software, and firmware mechanisms strictly internal to security-relevant hardware, software, and firmware include mapping registers and direct memory input and output."
        }
    ],
    "group_title": "System and Services Acquisition"
}