{
    "id": "sa-4.3",
    "class": "SP800-53-enhancement",
    "title": "Development Methods, Techniques, and Practices",
    "parameters": [
        {
            "id": "sa-4.3_prm_1",
            "label": "organization-defined systems engineering methods"
        },
        {
            "id": "sa-4.3_prm_2",
            "label": "organization-defined Selection (one or more): systems security; privacy"
        },
        {
            "id": "sa-4.3_prm_3",
            "label": "organization-defined software development methods; testing, evaluation, assessment, verification, and validation methods; and quality control processes"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-4(3)"
        },
        {
            "name": "sort-id",
            "value": "SA-04(03)"
        }
    ],
    "parts": [
        {
            "id": "sa-4.3_smt",
            "name": "statement",
            "prose": "Require the developer of the system, system component, or system service to demonstrate the use of a system development life cycle process that includes:",
            "parts": [
                {
                    "id": "sa-4.3_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "\n                     {{ sa-4.3_prm_1 }};"
                },
                {
                    "id": "sa-4.3_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "\n                     {{ sa-4.3_prm_2 }} engineering methods]; and"
                },
                {
                    "id": "sa-4.3_smt.c",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(c)"
                        }
                    ],
                    "prose": "\n                     {{ sa-4.3_prm_3 }}."
                }
            ]
        },
        {
            "id": "sa-4.3_gdn",
            "name": "guidance",
            "prose": "Following a system development life cycle that includes state-of-the-practice software development methods, systems engineering methods, systems security and privacy engineering methods, and quality control processes helps to reduce the number and severity of latent errors within systems, system components, and system services. Reducing the number and severity of such errors reduces the number of vulnerabilities in those systems, components, and services. Transparency in the methods and techniques that developers select and implement for systems engineering, systems security and privacy engineering, software development, component and system assessments, and quality control processes provides an increased level of assurance in the trustworthiness of the system, system component, or system service being acquired."
        }
    ],
    "group_title": "System and Services Acquisition"
}