{
    "id": "sa-8.8",
    "class": "SP800-53-enhancement",
    "title": "Secure Evolvability",
    "parameters": [
        {
            "id": "sa-8.8_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(8)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(08)"
        }
    ],
    "links": [
        {
            "href": "#cm-3",
            "rel": "related",
            "text": "CM-3"
        }
    ],
    "parts": [
        {
            "id": "sa-8.8_smt",
            "name": "statement",
            "prose": "Implement the security design principle of secure evolvability in {{ sa-8.8_prm_1 }}."
        },
        {
            "id": "sa-8.8_gdn",
            "name": "guidance",
            "prose": "The principle of secure evolvability states that a system is developed to facilitate the maintenance of its security properties when there are changes to the system’s structure, interfaces, interconnections (i.e., system architecture), functionality, or configuration (i.e., security policy enforcement). Changes include a new, enhanced, or upgraded system capability; maintenance and sustainment activities; and reconfiguration. Although it is not possible to plan for every aspect of system evolution, system upgrades and changes can be anticipated by analyses of mission or business strategic direction, anticipated changes in the threat environment, and anticipated maintenance and sustainment needs. It is unrealistic to expect that complex systems remain secure in contexts not envisioned during development, whether such contexts are related to the operational environment or to usage. A system may be secure in some new contexts, but there is no guarantee that its emergent behavior will always be secure. It is easier to build trustworthiness into a system from the outset, and it follows that the sustainment of system trustworthiness requires planning for change as opposed to adapting in an ad hoc or non-methodical manner. The benefits of this principle include reduced vendor life cycle costs, reduced cost of ownership, improved system security, more effective management of security risk, and less risk uncertainty."
        }
    ],
    "group_title": "System and Services Acquisition"
}