{
    "id": "sa-8.26",
    "class": "SP800-53-enhancement",
    "title": "Performance Security",
    "parameters": [
        {
            "id": "sa-8.26_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(26)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(26)"
        }
    ],
    "links": [
        {
            "href": "#sc-12",
            "rel": "related",
            "text": "SC-12"
        },
        {
            "href": "#sc-13",
            "rel": "related",
            "text": "SC-13"
        },
        {
            "href": "#si-2",
            "rel": "related",
            "text": "SI-2"
        },
        {
            "href": "#si-7",
            "rel": "related",
            "text": "SI-7"
        }
    ],
    "parts": [
        {
            "id": "sa-8.26_smt",
            "name": "statement",
            "prose": "Implement the security design principle of performance security in {{ sa-8.26_prm_1 }}."
        },
        {
            "id": "sa-8.26_gdn",
            "name": "guidance",
            "prose": "The principle of performance security states that security mechanisms are constructed so that they do not degrade system performance unnecessarily. Stakeholder and system design requirements for performance and security are precisely articulated and prioritized. For the system implementation to meet its design requirements and be found acceptable to stakeholders (i.e., validation against stakeholder requirements), the designers adhere to the specified constraints that capability performance needs place on protection needs. The overall impact of computationally intensive security services (e.g., cryptography) are assessed and demonstrated to pose no significant impact to higher-priority performance considerations or are deemed to provide an acceptable trade-off of performance for trustworthy protection. The trade-off considerations include less computationally intensive security services unless they are unavailable or insufficient. The insufficiency of a security service is determined by functional capability and strength of mechanism. The strength of mechanism is selected with respect to security requirements, performance-critical overhead issues (e.g., cryptographic key management), and an assessment of the capability of the threat.\nThe principle of performance security leads to the incorporation of features that help in the enforcement of security policy but incur minimum overhead, such as low-level hardware mechanisms upon which higher-level services can be built. Such low-level mechanisms are usually very specific, have very limited functionality, and are optimized for performance. For example, once access rights to a portion of memory is granted, many systems use hardware mechanisms to ensure that all further accesses involve the correct memory address and access mode. Application of this principle reinforces the need to design security into the system from the ground up and to incorporate simple mechanisms at the lower layers that can be used as building blocks for higher-level mechanisms."
        }
    ],
    "group_title": "System and Services Acquisition"
}