{
    "id": "sa-8.32",
    "class": "SP800-53-enhancement",
    "title": "Sufficient Documentation",
    "parameters": [
        {
            "id": "sa-8.32_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(32)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(32)"
        }
    ],
    "links": [
        {
            "href": "#at-2",
            "rel": "related",
            "text": "AT-2"
        },
        {
            "href": "#at-3",
            "rel": "related",
            "text": "AT-3"
        },
        {
            "href": "#sa-5",
            "rel": "related",
            "text": "SA-5"
        }
    ],
    "parts": [
        {
            "id": "sa-8.32_smt",
            "name": "statement",
            "prose": "Implement the security design principle of sufficient documentation in {{ sa-8.32_prm_1 }}."
        },
        {
            "id": "sa-8.32_gdn",
            "name": "guidance",
            "prose": "The principle of sufficient documentation states that organizational personnel with responsibilities to interact with the system are provided with adequate documentation and other information such that the personnel contribute to rather than detract from system security. Despite attempts to comply with principles such as human factored security and acceptable security, systems are inherently complex, and the design intent for the use of security mechanisms and the ramifications of the misuse or misconfiguration of security mechanisms are not always intuitively obvious. Uninformed and insufficiently trained users can introduce vulnerabilities due to errors of omission and commission. The availability of documentation and training can help to ensure a knowledgeable cadre of personnel, all of whom have a critical role in the achievement of principles such as continuous protection. Documentation is written clearly and supported by training that provides security awareness and understanding of security-relevant responsibilities."
        }
    ],
    "group_title": "System and Services Acquisition"
}