{
    "id": "sa-8.9",
    "class": "SP800-53-enhancement",
    "title": "Trusted Components",
    "parameters": [
        {
            "id": "sa-8.9_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(9)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(09)"
        }
    ],
    "parts": [
        {
            "id": "sa-8.9_smt",
            "name": "statement",
            "prose": "Implement the security design principle of trusted components in {{ sa-8.9_prm_1 }}."
        },
        {
            "id": "sa-8.9_gdn",
            "name": "guidance",
            "prose": "The principle of trusted components states that a component is trustworthy to at least a level commensurate with the security dependencies it supports (i.e., how much it is trusted to perform its security functions by other components). This principle enables the composition of components such that trustworthiness is not inadvertently diminished and the trust is not consequently misplaced. Ultimately, this principle demands some metric by which the trust in a component and the trustworthiness of a component can be measured on the same abstract scale. The principle of trusted components is particularly relevant when considering systems and components in which there are complex chains of trust dependencies. A trust dependency is also referred to as a trust relationship and there may be chains of trust relationships.\nThe principle of trusted components also applies to a compound component that consists of subcomponents (e.g., a subsystem), which may have varying levels of trustworthiness. The conservative assumption is that the trustworthiness of a compound component is that of its least trustworthy subcomponent. It may be possible to provide a security engineering rationale that the trustworthiness of a particular compound component is greater than the conservative assumption. However, any such rationale reflects logical reasoning based on a clear statement of the trustworthiness objectives as well as relevant and credible evidence. The trustworthiness of a compound component is not the same as increased application of defense-in-depth layering within the component or a replication of components. Defense-in-depth techniques do not increase the trustworthiness of the whole above that of the least trustworthy component."
        }
    ],
    "group_title": "System and Services Acquisition"
}