{
    "id": "sa-8.10",
    "class": "SP800-53-enhancement",
    "title": "Hierarchical Trust",
    "parameters": [
        {
            "id": "sa-8.10_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(10)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(10)"
        }
    ],
    "parts": [
        {
            "id": "sa-8.10_smt",
            "name": "statement",
            "prose": "Implement the security design principle of hierarchical trust in {{ sa-8.10_prm_1 }}."
        },
        {
            "id": "sa-8.10_gdn",
            "name": "guidance",
            "prose": "The principle of hierarchical trust for components builds on the principle of trusted components and states that the security dependencies in a system will form a partial ordering if they preserve the principle of trusted components. The partial ordering provides the basis for trustworthiness reasoning or an assurance case (assurance argument) when composing a secure system from heterogeneously trustworthy components. To analyze a system composed of heterogeneously trustworthy components for its trustworthiness, it is essential to eliminate circular dependencies with regard to the trustworthiness. If a more trustworthy component located in a lower layer of the system were to depend on a less trustworthy component in a higher layer, this would, in effect, put the components in the same “less trustworthy” equivalence class per the principle of trusted components. Trust relationships, or chains of trust, can have various manifestations. For example, the root certificate of a certificate hierarchy is the most trusted node in the hierarchy, whereas the leaves in the hierarchy may be the least trustworthy nodes. Another example occurs in a layered high-assurance system where the security kernel (including the hardware base), which is located at the lowest layer of the system, is the most trustworthy component. The principle of hierarchical trust, however, does not prohibit the use of overly trustworthy components. There may be cases in a system of low trustworthiness where it is reasonable to employ a highly trustworthy component rather than one that is less trustworthy (e.g., due to availability or other cost-benefit driver). For such a case, any dependency of the highly trustworthy component upon a less trustworthy component does not degrade the trustworthiness of the resulting low-trust system."
        }
    ],
    "group_title": "System and Services Acquisition"
}