{
    "id": "sa-8.22",
    "class": "SP800-53-enhancement",
    "title": "Accountability and Traceability",
    "parameters": [
        {
            "id": "sa-8.22_prm_1",
            "label": "organization-defined systems or system components"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-8(22)"
        },
        {
            "name": "sort-id",
            "value": "SA-08(22)"
        }
    ],
    "links": [
        {
            "href": "#ac-6",
            "rel": "related",
            "text": "AC-6"
        },
        {
            "href": "#au-2",
            "rel": "related",
            "text": "AU-2"
        },
        {
            "href": "#au-3",
            "rel": "related",
            "text": "AU-3"
        },
        {
            "href": "#au-6",
            "rel": "related",
            "text": "AU-6"
        },
        {
            "href": "#au-9",
            "rel": "related",
            "text": "AU-9"
        },
        {
            "href": "#au-10",
            "rel": "related",
            "text": "AU-10"
        },
        {
            "href": "#au-12",
            "rel": "related",
            "text": "AU-12"
        },
        {
            "href": "#ia-2",
            "rel": "related",
            "text": "IA-2"
        },
        {
            "href": "#ir-4",
            "rel": "related",
            "text": "IR-4"
        }
    ],
    "parts": [
        {
            "id": "sa-8.22_smt",
            "name": "statement",
            "prose": "Implement the security design principle of accountability and traceability in {{ sa-8.22_prm_1 }}."
        },
        {
            "id": "sa-8.22_gdn",
            "name": "guidance",
            "prose": "The principle of accountability and traceability states that it is possible to trace security-relevant actions (i.e., subject-object interactions) to the entity on whose behalf the action is being taken. The principle of accountability and traceability requires a trustworthy infrastructure that can record details about actions that affect system security (e.g., an audit subsystem). To record the details about actions, the system is able to uniquely identify the entity on whose behalf the action is being carried out and also record the relevant sequence of actions that are carried out. The accountability policy also requires that audit trail itself be protected from unauthorized access and modification. The principle of least privilege assists in tracing the actions to particular entities, as it increases the granularity of accountability. Associating specific actions with system entities, and ultimately with users, and making the audit trail secure against unauthorized access and modifications provide non-repudiation because once an action is recorded, it is not possible to change the audit trail. Another important function that accountability and traceability serves is in the routine and forensic analysis of events associated with the violation of security policy. Analysis of audit logs may provide additional information that may be helpful in determining the path or component that allowed the violation of the security policy and the actions of individuals associated with the violation of the security policy."
        }
    ],
    "group_title": "System and Services Acquisition"
}