{
    "id": "sa-9.3",
    "class": "SP800-53-enhancement",
    "title": "Establish and Maintain Trust Relationship with Providers",
    "parameters": [
        {
            "id": "sa-9.3_prm_1",
            "label": "organization-defined security and privacy requirements, properties, factors, or conditions defining acceptable trust relationships"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SA-9(3)"
        },
        {
            "name": "sort-id",
            "value": "SA-09(03)"
        }
    ],
    "links": [
        {
            "href": "#sr-2",
            "rel": "related",
            "text": "SR-2"
        }
    ],
    "parts": [
        {
            "id": "sa-9.3_smt",
            "name": "statement",
            "prose": "Establish, document, and maintain trust relationships with external service providers based on the following requirements, properties, factors, or conditions: {{ sa-9.3_prm_1 }}."
        },
        {
            "id": "sa-9.3_gdn",
            "name": "guidance",
            "prose": "Trust relationships between organizations and external service providers reflect the degree of confidence that the risk from using external services is at an acceptable level. Trust relationships can help organizations gain increased levels of confidence that service providers are providing adequate protection for the services rendered and can also be useful when conducting incident response or when planning for upgrades or obsolescence. Trust relationships can be complicated due to the potentially large number of entities participating in the consumer-provider interactions, subordinate relationships and levels of trust, and types of interactions between the parties. In some cases, the degree of trust is based on the level of control that organizations can exert on external service providers regarding the controls necessary for the protection of the service, information, or individual privacy and the evidence brought forth as to the effectiveness of the implemented controls. The level of control is established by the terms and conditions of the contracts or service-level agreements."
        }
    ],
    "group_title": "System and Services Acquisition"
}