{
    "id": "sc-30.3",
    "class": "SP800-53-enhancement",
    "title": "Change Processing and Storage Locations",
    "parameters": [
        {
            "id": "sc-30.3_prm_1",
            "label": "organization-defined processing and/or storage"
        },
        {
            "id": "sc-30.3_prm_2",
            "select": {
                "alternatives": [
                    "\n                     {{ sc-30.3_prm_3 }}\n                  ",
                    "at random time intervals"
                ]
            }
        },
        {
            "id": "sc-30.3_prm_3",
            "depends-on": "sc-30.3_prm_2",
            "label": "organization-defined time frequency"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SC-30(3)"
        },
        {
            "name": "sort-id",
            "value": "SC-30(03)"
        }
    ],
    "parts": [
        {
            "id": "sc-30.3_smt",
            "name": "statement",
            "prose": "Change the location of {{ sc-30.3_prm_1 }}\n                  {{ sc-30.3_prm_2 }}]."
        },
        {
            "id": "sc-30.3_gdn",
            "name": "guidance",
            "prose": "Adversaries target critical mission and business functions and the systems that support those mission and business functions while also trying to minimize the exposure of their existence and tradecraft. The static, homogeneous, and deterministic nature of organizational systems targeted by adversaries make such systems more susceptible to attacks with less adversary cost and effort to be successful. Changing processing and storage locations (also referred to as moving target defense) addresses the advanced persistent threat using techniques such as virtualization, distributed processing, and replication. This enables organizations to relocate the system components (i.e., processing, storage) that support critical mission and business functions. Changing the locations of processing activities and/or storage sites introduces a degree of uncertainty into the targeting activities of adversaries. The targeting uncertainty increases the work factor of adversaries and makes compromises or breaches of the organizational systems more difficult and time-consuming. It also increases the chances that adversaries may inadvertently disclose certain aspects of their tradecraft while attempting to locate critical organizational resources."
        }
    ],
    "group_title": "System and Communications Protection"
}