{
    "id": "sc-7.10",
    "class": "SP800-53-enhancement",
    "title": "Prevent Exfiltration",
    "parameters": [
        {
            "id": "sc-7.10_prm_1",
            "label": "organization-defined frequency"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SC-7(10)"
        },
        {
            "name": "sort-id",
            "value": "SC-07(10)"
        }
    ],
    "links": [
        {
            "href": "#ac-2",
            "rel": "related",
            "text": "AC-2"
        },
        {
            "href": "#ca-8",
            "rel": "related",
            "text": "CA-8"
        },
        {
            "href": "#si-3",
            "rel": "related",
            "text": "SI-3"
        }
    ],
    "parts": [
        {
            "id": "sc-7.10_smt",
            "name": "statement",
            "parts": [
                {
                    "id": "sc-7.10_smt.a",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(a)"
                        }
                    ],
                    "prose": "Prevent the exfiltration of information; and"
                },
                {
                    "id": "sc-7.10_smt.b",
                    "name": "item",
                    "properties": [
                        {
                            "name": "label",
                            "value": "(b)"
                        }
                    ],
                    "prose": "Conduct exfiltration tests {{ sc-7.10_prm_1 }}."
                }
            ]
        },
        {
            "id": "sc-7.10_gdn",
            "name": "guidance",
            "prose": "Prevention of exfiltration applies to both the intentional and unintentional exfiltration of information. Techniques used to prevent the exfiltration of information from systems may be implemented at internal endpoints, external boundaries, and across managed interfaces and include adherence to protocol formats, monitoring for beaconing activity from systems, disconnecting external network interfaces except when explicitly needed, employing traffic profile analysis to detect deviations from the volume and types of traffic expected, call backs to command and control centers, conducting penetration testing, monitoring for steganography, disassembling and reassembling packet headers, and using data loss and data leakage prevention tools. Devices that enforce strict adherence to protocol formats include deep packet inspection firewalls and Extensible Markup Language (XML) gateways. The devices verify adherence to protocol formats and specifications at the application layer and identify vulnerabilities that cannot be detected by devices that operate at the network or transport layers. The prevention of exfiltration is similar to data loss prevention or data leakage prevention and is closely associated with cross-domain solutions and system guards that enforce information flow requirements."
        }
    ],
    "group_title": "System and Communications Protection"
}