{
    "id": "sr-5.2",
    "class": "SP800-53-enhancement",
    "title": "Assessments Prior to Selection, Acceptance, Modification, or Update",
    "properties": [
        {
            "name": "label",
            "value": "SR-5(2)"
        },
        {
            "name": "sort-id",
            "value": "SR-05(02)"
        }
    ],
    "links": [
        {
            "href": "#ca-8",
            "rel": "related",
            "text": "CA-8"
        },
        {
            "href": "#ra-5",
            "rel": "related",
            "text": "RA-5"
        },
        {
            "href": "#sa-11",
            "rel": "related",
            "text": "SA-11"
        },
        {
            "href": "#si-7",
            "rel": "related",
            "text": "SI-7"
        },
        {
            "href": "#sr-9",
            "rel": "related",
            "text": "SR-9"
        }
    ],
    "parts": [
        {
            "id": "sr-5.2_smt",
            "name": "statement",
            "prose": "Assess the system, system component, or system service prior to selection, acceptance, modification, or update."
        },
        {
            "id": "sr-5.2_gdn",
            "name": "guidance",
            "prose": "Organizational personnel or independent, external entities conduct assessments of systems, components, products, tools, and services to uncover evidence of tampering, unintentional and intentional vulnerabilities, or evidence of non-compliance with supply chain controls. These include malicious code, malicious processes, defective software, backdoors, and counterfeits. Assessments can include evaluations; design proposal reviews; visual or physical inspection; static and dynamic analyses; visual, x-ray, or magnetic particle inspections; simulations; white, gray, or black box testing; fuzz testing; stress testing; and penetration testing (see SR-6(1)). Evidence generated during assessments is documented for follow-on actions by organizations. The evidence generated during the organizational or independent assessments of supply chain elements may be used to improve supply chain processes and inform the supply chain risk management process. The evidence can be leveraged in follow-on assessments. Evidence and other documentation may be shared in accordance with organizational agreements."
        }
    ],
    "group_title": "Supply Chain Risk Management"
}