{
    "id": "sr-6.1",
    "class": "SP800-53-enhancement",
    "title": "Testing and Analysis",
    "parameters": [
        {
            "id": "sr-6.1_prm_1",
            "select": {
                "how-many": "one or more",
                "alternatives": [
                    "organizational analysis, independent third-party analysis, organizational testing, independent third-party testing"
                ]
            }
        },
        {
            "id": "sr-6.1_prm_2",
            "label": "organization-defined supply chain elements, processes, and actors"
        }
    ],
    "properties": [
        {
            "name": "label",
            "value": "SR-6(1)"
        },
        {
            "name": "sort-id",
            "value": "SR-06(01)"
        }
    ],
    "links": [
        {
            "href": "#ca-8",
            "rel": "related",
            "text": "CA-8"
        },
        {
            "href": "#si-4",
            "rel": "related",
            "text": "SI-4"
        }
    ],
    "parts": [
        {
            "id": "sr-6.1_smt",
            "name": "statement",
            "prose": "Employ {{ sr-6.1_prm_1 }} of the following supply chain elements, processes, and actors associated with the system, system component, or system service: {{ sr-6.1_prm_2 }}."
        },
        {
            "id": "sr-6.1_gdn",
            "name": "guidance",
            "prose": "Relationships between entities and procedures within the supply chain, including development and delivery, are considered. Supply chain elements include organizations, entities, or tools that are used for the research and development, design, manufacturing, acquisition, delivery, integration, operations, maintenance, and disposal of systems, system components, or system services. Supply chain processes include supply chain risk management programs; SCRM strategies and implementation plans; personnel and physical security programs; hardware, software, and firmware development processes; configuration management tools, techniques, and measures to maintain provenance; shipping and handling procedures; and programs, processes, or procedures associated with the production and distribution of supply chain elements. Supply chain actors are individuals with specific roles and responsibilities in the supply chain. The evidence generated and collected during analyses and testing of supply chain elements, processes, and actors is documented and used to inform organizational risk management activities and decisions."
        }
    ],
    "group_title": "Supply Chain Risk Management"
}